Revit 2027 API
RPCNode Class
 This class represents an RPC content in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.RPCNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RPCNode : ContentNode
Public Class RPCNode
	Inherits ContentNode
public ref class RPCNode : public ContentNode
type RPCNode =
    class
        inherit ContentNode
    end
The RPCNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAsset |  Returns an an instance of an Asset object, which contains definitions of the content node.
(Inherited from ContentNode)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTransform |  A transformation matrix associated with the node.
(Inherited from ContentNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnRPC(RPCNode).
See Also
Reference
Autodesk.Revit.DB Namespace